app/controllers/menus_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."category" = $1  [["category", "appetizers"]]
---
  def index
    @recipes = Recipe.all
    @appetizers = Recipe.where(category: "appetizers")